; -------------------------------------------------------------------------------------------------
;
; 7z SFX Builder Language File
;
; Translation Instructions:
;	File extension must be '.ini' in order to make 7z SFX Builder load language file.
;	DON'T remove SECTION NAMES! (ex: [LangOptions], [Global] ...)
;	Update your and language information in 'LangOptions' section
;	Save the file in Unicode format
;	E-mail new language files to mirza.b.1695@gmail.com for inclusion in main installer.
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function.
;	\n - indicates a newline character, which will be replaced when displayed.
;	\~n - indicates double newline character.
;	\s - indicates a special strings (generally file names)
;		The order and number of \s variables is very important and should not be modified.
;	\~s - same as \s. only quotes are added.
;
; -------------------------------------------------------------------------------------------------

[LangOptions]
; here write ENGLISH name of your language
LANG_NAME="Italian"
; here write NATIVE name of your language
LANG_NATIVE_NAME="Italiano"
VERSION=2.1
NAME=Gianluca Papi
; add 'mailto:' prefix if you type E-mail adress
CONTACT=mailto:gianluca.papi@gmail.com

[Global]
TIP_ADD="Aggiungi"
TIP_EDIT="Edita"
TIP_DELETE="Cancella"
TIP_DELETE_ALL="Cancella Tutto"
TIP_MOVE_UP="Muovi in su"
TIP_MOVE_DOWN="Muovi in giù"
BTN_SAVE="Salva"
BTN_CANCEL="Annulla"
CHK_QUOTES="Racchiudi fra quote"
LST_SEC_QUOTES="Quote"
ERROR_MSG_TITLE="Errore!"
WARNING_MSG_TITLE="Attenzione"
INFORMATION_MSG_TITLE="Informazione"
QUESTION_MSG_TITLE="Domanda"
BTN_OK="OK"
TEST="Test"
TIP_BROWSE="Sfoglia"
TIP_OPEN="Apri percorso file"

[Menu]
MENU_FILE="&File"
MENU_SETTINGS="&Impostazioni"
MENU_HELP="&Help"
MI_OPEN="&Apri file..."
MI_RELOAD=R&iapri
MI_SAVE="&Salva"
MI_SAVE_AS="Salva &come..."
MI_CLOSE="&Chiudi"
SUB_MENU_RECENT_FILES="&Files recenti"
MI_CLEAR_LIST="C&ancella lista"
MI_EXIT="E&sci"
MI_OPTIONS="&Opzioni"
SUB_MENU_LANG="&Lingua"
MI_HELP="Hel&p"
MI_SITE=Sito del &progetto
MI_ABOUT="A&bout"
MI_PRESET_MANAGER="Manager Preimpostazioni"

[ToolbarTips]
OPEN="Apri file"
SAVE="Salva"
SAVE_AS="Salva come"
CLOSE="Chiudi file"
TEST="Test"
PRESET="Gestisci preimpostazioni"
MAKE_SFX="Crea SFX"
OPTIONS=Opzioni del programma

[TabNames]
MAIN=Principale
TITLE_TEXT="Titolo/Testo"
DIALOGS="Dialoghi"
RUN=Esegui
DELETE="Cancella"
SHORTCUTS="Scorciatoie"
SET_ENV=Impostazioni Ambiente
OUTPUT="Destinazione"
SFX="SFX"

[Tab_Main]
CHK_TEMP_MODE=Modalità Temporanea
CHK_SKIP_LOCKED=Salta files di sistema bloccati
CHK_DELETE_SFX="Cancella File SFX dopo l'estrazione"
CHK_BPT="BeginPrompt Timeout:"
CHK_XDWIDTH="Lunghezza dialogo di estrazione:"
CHK_XPWIDTH="Lunghezza percorso di estrazione:"
CHK_VOLNAME="Stile nome del volume:"
RAD_OW_MODE_1="Sovrascrivi tutti i files"
RAD_OW_MODE_2="Non sovrascrivere files"
RAD_OW_MODE_3="Sovrascrivi vecchi files"
RAD_GUI_MODE_1=Mostra tutte le GUI
RAD_GUI_MODE_2=Disabilita annullamento durante l'estrazione"
RAD_GUI_MODE_3="Nascondi tutte le finestre GUI"
GRP_OW_MODE="Modalità di Sovrascrittura:"
GRP_GUI_MODE="Modalità GUI:"
LBL_EXT_PATH="Percorso di Estrazione:"
MI_SFX_NAME="Nome SFX"
MI_SFX_PATH="Percorso SFX"
TIP_EDIT="Clicca per editare"
TIP_INSERT="Clicca per inserire variabili"
TIP_RELOAD="Ricarica"
TIP_OPEN="Apri con editor testuale predefinito"

[Tab_TitleText]
GRP_TITLE="Titolo"
GRP_TEXT="Testo"
LBL_WIN_TITLE="Titolo Finestra:"
LBL_EXT_PATH_WIN_TITLE="Titolo Finestra Percorso di estrazione:"
LBL_EXT_WIN_TITLE="Titolo Estrazione:"
LBL_ERROR_WIN_TITLE="Titolo Messaggio di Errore:"
LBL_WARN_WIN_TITLE="Titolo Messaggio di Attenzione:"
LBL_PASSWD_TITLE="Titolo Password:"
LBL_PASSWD_TEXT="Testo Password:"
LBL_EXT_CANCEL_TEXT="Testo Annullamento Estrazione:"

[Tab_RunProgram]
LST_SEC_PARAMETER="Parametro"
LST_SEC_PREFIX="Prefisso"
LST_SEC_FILE_FOLDER="Percorso File"
LST_SEC_COMMANDS="Comandi"

[Tab_Delete]
LST_SEC_PARAMETER="Parametro"
LST_SEC_FILE_FOLDER="Percorso File/Cartella"

[Tab_Shortcuts]
LST_SEC_PARAMETER="Parametro"
LST_SEC_PATH="Percorso"
LST_SEC_SRC="Sorgente"
LST_SEC_CMDS="Comandi"
LST_SEC_NAME="Nome"
LST_SEC_DESC="Descrizione"
LST_SEC_DEST="Destinazione"
LST_SEC_WD="Cartella di Lavoro"
LST_SEC_ICON="Icona"
LST_SEC_INDEX="Indice"

[Tab_SetEnvironment]
LST_SEC_NAME="Nome Variabile"
LST_SEC_VALUE="Valore"

[Tab_SFX]
BTN_SELECT="Seleziona..."
BTN_MAKE_SFX="Crea SFX"
BTN_SFX_OPTIONS="Opzioni SFX"
BTN_EDIT_VERS=Edita Info Versione
CHK_INCLUDE_PATH="Includi percorso nel file di configurazione"
CHK_USE_SELECTED_CFG="Usa file di configurazione selezionato"
GRP_SFX_FILES="Files SFX"
GRP_SFX_ICON="Icona"
LBL_CONFIG_FILE="File di configurazione:"
LBL_7Z_ARCHIVE="Archivio 7z:"
LBL_SFX_MODULE="Modulo SFX:"
LBL_SFX_PATH="Percorso SFX:"
LBL_SFX_ICON="Icona SFX:"

[GUI_ProgramOptions]
GUI_TITLE=Opzioni del programma
BTN_INTEGRATE="Integra programma nel menu contestuale"
BTN_EXPORT="Esporta..."
MI_REGISTRY="File di registro..."
MI_INI="File INI..."
CHK_USERMODE="Salva impostazioni nel registro"
CHK_AUTODEFMOD=Usa il modulo predefinito se la configurazione caricata non lo contiene
CHK_IGNORE_EMPTY="Non creare versioni vuote di chiavi info"
CHK_AUTO_NAME_SFX="Crea file SFX nel percorso dell'archivio se il percorso SFX non è definito"
CHK_OVERWRITE_FILES="Sovrascrivi files SFX esistenti"
GRP_PROGRAM="Programma"
GRP_SFX="SFX"
LBL_LANGUAGE="Lingua dell'interfaccia:"

[GUI_PresetManager]
GUI_TITLE="Manager Preimpostazioni"
GUI_TITLE2="Nuove Preimpostazioni"
GUI_TITLE3="Rinomina Preimpostazioni"
BTN_NEW="Nuovo"
BTN_LOAD="Carica"
BTN_SAVE="Salva"
BTN_EDIT="Edit nome"
BTN_DELETE="Cancella"
LBL_NAME="Digita nome preimpostazioni:"

[GUI_ArchiveSets]
CHK_SUBFILES="Archivia solo files/cartelle allocate nella cartella data"
LBL_DRAGDROP="Puoi usare la funzione Drag and Drop per aggiungere files/cartelle"
TIP_ADDFILE="Aggiungi file(s)"
TIP_ADDFOLDER="Aggiungi cartella"

[GUI_SFXOpts]
GUI_TITLE="Opzioni SFX"
TAB_SFX_OPTIONS="Opzioni SFX"
TAB_ARCHIVE_FILES="Archivia Files"
CHK_USE_UPX="Comprimi moduli SFX con UPX"
CHK_USE_SFX_MOD="Usa i seguenti moduli SFX:"
CMB_USE_7ZIP1="Usa sempre 7-Zip"
CMB_USE_7ZIP2="Usa 7-Zip solo se i files di archivio sono specificati"
CMB_USE_7ZIP3="Non usare 7-Zip se l'Archivio 7z è specificato"
CMB_USE_7ZIP4="Non usare mai 7-Zip"
LBL_PATH="Percorso di 7-Zip"
TIP_BROWSE="Seleziona il percorso di 7-Zip"
TIP_CONFIG="Configurazione 7-Zip"
7ZIP_TITLE="Configurazione 7-Zip"
7ZIP_LEVEL="Livello Compressione:"
7ZIP_METHOD="Metodo di Compressione:"
7ZIP_DICT="Grandezza dizionario:"
7ZIP_SOLID="Grandezza Solidi:"

[GUI_VersionInfo]
GUI_TITLE="Edit info versione file"
BTN_LOAD="Carica"
MI_LOAD_SFXMOD="Dai moduli selezionati"
MI_LOAD_FILE="Da file..."
MI_LOAD_VALUES="Carica valori salvati"
MI_SAVE_VALUES="Salva valori correnti"
CHK_INCLUDE="Includi informazioni nel file di configurazione"
CHK_CHANGE_VERS="Cambia info versione"

[GUI_Gui.MiscFlags]
GUI_TITLE="Edit GUI/Misc Flags"
BTN_NEW="Nuovo"
BTN_LOAD="Carica"
BTN_RESET="Azzera"
BTN_DELETE="Cancella"
LBL_GUI_FLAG_1="Mostra la percentuale di estrazione nella Barra del Titolo a destra (predefinito -  a sinistra)"
LBL_GUI_FLAG_2="Non visualizzare la percentuale di estrazione nella Barra del Titolo"
LBL_GUI_FLAG_4="Mostra la percentuale di estrazione sotto la Barra di Progresso"
LBL_GUI_FLAG_8="Usa stili di Windows XP (schema)"
LBL_GUI_FLAG_16="Usa carattere grassetto per la percentuale di estrazione"
LBL_GUI_FLAG_32="Visualizza un'icona nella finestra del progresso di estrazione"
LBL_GUI_FLAG_64="Usa la finestra 'BeginPrompt' per specificare il percorso di estrazione"
LBL_GUI_FLAG_128="Usa una finestra separata per specificare il percorso di estrazione"
LBL_GUI_FLAG_256="Conferma l'abolizione dell'installazione/estrazione"
LBL_GUI_FLAG_512="Non visualizzare un'icona nella Barra del Titolo di tutte le finestre e su [Alt+Tab]"
LBL_GUI_FLAG_1024="Visualizza un'icona nella finestra per specificare il percorso di estrazione"
LBL_GUI_FLAG_2048="Visualizza un'icona nella finestra 'BeginPrompt'"
LBL_GUI_FLAG_4096="Cambia un'icona e nomi dei bottoni. Invece di 'Sì'-'No' sarà 'OK'-'Annulla'"
LBL_GUI_FLAG_8192="Non mostrare la Barra di Progresso nella Barra Progetti in Windows 7 o successivo"
LBL_GUI_FLAG_16384="Mostra simboli '&&' nei testi"
LBL_MISC_FLAG_1="Non verificare spazio disco libero necessario per l'estrazione"
LBL_MISC_FLAG_2="Non verificare RAM libera necessaria per l'estrazione"
LBL_MISC_FLAG_4="Richiedi privilegi di amministratore per tutte le operazioni"
LBL_MISC_FLAG_8=Mostra finestra di richiesta password dopo le finestre 'BeginPrompt' e 'ExtractPath'"

[GUI_RunProgram]
GUI_TITLE="Aggiungi programmi da lanciare dopo l'estrazione"
GUI_PFX_TITLE="Edita prefissi"
LBL_PARAMETER=Parametro:
LBL_FILE="File:"
LBL_PREFIX="Prefisso:"
LBL_COMMANDS="Comandi:"

[GUI_Delete]
GUI_TITLE="Aggiungi files da cancellare dopo l'estrazione"
LBL_PARAMETER="Parametro:"
LBL_FILE="File/Cartella:"

[GUI_Shortcuts]
GUI_TITLE=Aggiungi scorciatoie da creare
RAD_DESKTOP="Desktop"
RAD_START_MENU=Menu Start
RAD_PROGRAMS=Menu Start\Programmi
RAD_STARTUP="Startup"
RAD_CURRENT_USER=Utente corrente
RAD_ALLUSERS=Tutti gli Utenti
GRP_CREATION_PATH="Dove creare"
GRP_CREATE_FOR=Creato per
GRP_PARAMETER="Parametro:"
LBL_SOURCE_FILE=File sorgente:
LBL_ARGUMENTS="Argomenti:"
LBL_NAME=Nome scorciatoia:
LBL_DESCRIPTION=Descrizione scorciatoia:
LBL_DEST_FOLDER=Cartella di destinazione:
LBL_WORKING_DIR=Cartella di Lavoro:
LBL_ICON_FILE="File icona:"
LBL_ICON_INDEX="Indice icona:"

[GUI_SetEnvironment]
GUI_TITLE="Crea environment variables"
LBL_NAME="Nome:"
LBL_VALUE="Valore:"

[GUI_MakeSFX]
GUI_TITLE=Creazione SFX in corso...
BTN_OPEN=Sfoglia
BTN_RUN=Lancia SFX
BTN_CLOSE=Chiudi
REPORT_PREP=In Preparazione...
REPORT_ARCHIVE1=Creazione archivio...
REPORT_ARCHIVE2=7-Zip non esiste!
REPORT_ARCHIVE3=Il file non esiste: \~s
REPORT_ARCHIVE4=Archivio creato con successo
REPORT_ARCHIVE5=Impossibile creare l'archivio!
REPORT_ERROR1=Impossibile trovare il file di configuratione: \~s
REPORT_ERROR2=Il seguente file non è un file di configurazione 7z SFX: \~s
REPORT_ERROR3="Errore durante la creazione dell'SFX!"
REPORT_ICON1=Cambio in corso dell'icona SFX...
REPORT_ICON2="Icona SFX cambiata con successo"
REPORT_ICON3="Can't change SFX icon!"
REPORT_VERSINFO1="Updating version info..."
REPORT_VERSINFO2="Version info updated successfully"
REPORT_VERSINFO3="Can't update version info!"
REPORT_UPX1="Compressing with UPX..."
REPORT_UPX2="Compression completed successfully"
REPORT_UPX3="Can't find "upx.exe"!"
REPORT_BUILD1="Building SFX..."
REPORT_BUILD2="Errore durante la costruzione dell'SFX!"
REPORT_FINISH="SFX creato con successo a: \~s"

[MessageBoxes]
; File open/save operations
MSGBOX1_1="Impossibile trovare il file di lingua!"
MSGBOX1_2="Il file specificato non esiste!"
MSGBOX1_3="Il file non è stato caricato o non esiste!"
MSGBOX1_4="Il file di configurazione specificato non esiste!"
MSGBOX1_5="Vuoi aprire il file: \~n\~s - ?"
MSGBOX1_6="\~s\nnon è il file di configurazione 7z SFX!\~nVuoi caricarlo ugualmente?"
MSGBOX1_7="La grandezza del file è maggiore di un normale file di configurazione!\nVuoi caricarlo ugualmente?"
MSGBOX1_8=">Il file richiesto per la corrente operazione è mancante:\n\s"
MSGBOX1_9="This file doesn't contain configuration file! Impossibile continuare!"
MSGBOX1_10="Sei sicuro di voler ricaricare il file?"
MSGBOX1_11="La configurazione corrente non è stata salvata. Vuoi farlo ora?"
MSGBOX1_12="Impossibile leggere o scrivere il file! Assicurati di avere privilegi di amministratore."
; SFX creation
MSGBOX2_1="Il percorso del file SFX specificato non esiste!"
MSGBOX2_2="Il modulo SFX non è stato specificato!"
MSGBOX2_3="Il modulo SFX specificato non esiste o non ha il formato richiesto!"
MSGBOX2_4="I files di archivio non sono specificati!"
MSGBOX2_5="L'archivio non è specificato!"
MSGBOX2_6="L'archivio specificato non esiste o non ha il formato richiesto!"
MSGBOX2_7="Vuoi sovrascrivere il file esistente: \~n\~s - ?"
MSGBOX2_8="7-Zip non esiste!"
MSGBOX2_9="Vuoi usare il seguente file di archivio: \~n\~s - ?\~nClicca 'No' se vuoi creare un nuovo archivio dai files definiti nel file di configurazione."
; Other operations
MSGBOX3_1="Programma integrato con successo nel menu contestuale."
MSGBOX3_2="Premi 'OK' per chiudere la finestra per testare"
MSGBOX3_3="Vuoi sovrascrivere i valori esistenti?"
MSGBOX3_4="Prego, seleziona almeno un item."
MSGBOX3_5="Prego, seleziona solo un item."
MSGBOX3_6="Sei sicuro di voler cancellare l'item()selected item(s)?"
MSGBOX3_7="Sei sicuro di voler cancellare tutti gli items?"
MSGBOX3_8="Il dato specificato non è valido o vuoto!"
MSGBOX3_9="Il file non è specificato!"
